app/views/collections/show.html.erb


<% @collection.rocks.each do |collection| %>
---
SELECT "rocks".* FROM "rocks" WHERE "rocks"."collection_id" = 16


<% @collection.links.each do |collection| %>
---
SELECT "links".* FROM "links" WHERE "links"."collection_id" = 1


<% @collection.notes.each do |collection| %>
---
SELECT "notes".* FROM "notes" WHERE "notes"."collection_id" = 1