app/controllers/collections_controller.rb

SELECT "collections".* FROM "collections" WHERE "collections"."user_id" = 2 AND "collections"."id" = ? LIMIT 1  [["id", "splashHead"]]
---
  def show
    @collection = @user.collections.find(params[:id])