app/controllers/collections_controller.rb

  def index
    @collections = Collection.all
---
SELECT "collections".* FROM "collections"

  def show
    @collection = Collection.find(params[:id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @collection = Collection.find(params[:id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @collection = Collection.new(params[:collection])

    respond_to do |format|
      if @collection.save
---
INSERT INTO "collections" ("created_at", "description", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Mon, 30 Sep 2013 00:25:30 UTC +00:00], ["description", "Test"], ["name", "Test Collection"], ["updated_at", Mon, 30 Sep 2013 00:25:30 UTC +00:00], ["user_id", 1]]

  def update
    @collection = Collection.find(params[:id])

    respond_to do |format|
      if @collection.update_attributes(params[:collection])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "collections" SET "name" = '', "description" = 'The guitar is a type of chordophone, traditionally constructed from wood and strung with either nylon or steel strings and distinguished from other chordophones by its construction and tuning. The modern guitar was preceded by the lute, the vihuela, the four-course Renaissance guitar and the five-course baroque guitar, all of which contributed to the development of the modern six-string instrument.', "link" = '', "updated_at" = '2013-09-28 21:57:35.335829' WHERE "collections"."id" = 3

  def mail
    @collection = Collection.find(params[:id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", "1"]]