app/controllers/rocks_controller.rb

  def index
    @rocks = Rock.all
---
SELECT "rocks".* FROM "rocks"

  def show
    @rock = Rock.find(params[:id])
---
SELECT "rocks".* FROM "rocks" WHERE "rocks"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @rock = Rock.new(params[:rock])

    respond_to do |format|
      if @rock.save
---
INSERT INTO "rocks" ("collection_id", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["collection_id", 1], ["created_at", Sun, 29 Sep 2013 23:57:05 UTC +00:00], ["name", "Roar"], ["updated_at", Sun, 29 Sep 2013 23:57:05 UTC +00:00]]